package university;

public class ASD {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		/*1. Да се създаде програма за работа с масив от реални числа, в която след въвеждане на цяло положително число 
		 * N (N<20) чрез функции се реализира следното:
- въвеждане на елементите на масива, N на брой;
- намиране на сумата на първите N елементa.

2. Да се въведат в целочислен масив n на брой случайни положителни двуцифрени числа и да се намери числото, което се среща най-често в масива и колко пъти се среща.

3. Една квадратна таблица от числа се нарича магически квадрат, когато е изпълнено следното условие: всички суми, получени поотделно от сбора на елементите по всеки ред/всеки стълб/всеки от двата диагонала са равни.
Да се състави програма, която въвежда естествени числа от интервала [1..20] в дадена квадратна таблица и определя дали те образуват магически квадрат.

4. Да се състави програма, чрез която се въвеждат 9 реални числа от интервала [-99.99..99.99].
Проверете дали въведената редица е монотонно нарастваща.
Пример: 1 2 3 3 е, но 1 3 2 4 не е монотонно нарастваща
Използвайте рекурсия

5. Да се състави програма, чрез която се въвежда естествено число N от интервала [10..100010].
Програмата да извежда най-близкото по-голямо просто число.
Пример: 98 Изход 101

6. Да се състави програма, чрез която се въвежда естествено число N от интервала [10..10010] и се извежда сумата на цифрите му.
Пример: 15 Изход: 6
Използвайте рекурсия.

1. Напишете методи за сечение и обединение на списъци.
2. Напишете метод, който намира най-дългата подредица от равни числа в даден List<int> и връща като резултат нов 
List<int> със тази подредица.
3. Напишете програма, която премахва всички отрицателни числа от дадена редица.
4. Реализирайте структурата двойно свързан динамичен списък – списък, чиито елементи имат указател, 
както към следващия така и към пред­хождащия го елемент. Реализирайте операциите добавяне, премахване и търсене на елемент,
 добавяне на елемент на определено място (индекс),
 извличане на елемент по индекс и метод, който връща масив с елементите на списъка.
	}*/

}
}

